Emacs/.doom.d/My_Doom.org
#+TITLE: My_doom
#+description: This is a org file to store all my doom configuration neatly and organized
#+startup: fold
#+auto_tangle: t

* Table of Contents :TOC_2:
- [[#init][Init]]
  - [[#completion][Completion]]
  - [[#ui][UI]]
  - [[#editor][Editor]]
  - [[#emacs][Emacs]]
  - [[#term][Term]]
  - [[#checkers][Checkers]]
  - [[#tools][Tools]]
  - [[#os][OS]]
  - [[#languages][Languages]]
  - [[#email-apps-and-config][Email, Apps and Config]]
- [[#config][Config]]
  - [[#analisis][Analisis]]
  - [[#garbage-collection][Garbage collection]]
  - [[#backup][Backup]]
  - [[#main-variables][Main Variables]]
  - [[#emacs-configuration][Emacs Configuration]]
  - [[#splash-screen-config][Splash Screen config]]
  - [[#key-bindings][Key Bindings]]
  - [[#main-packages][Main Packages]]
  - [[#coding][Coding]]
  - [[#org-mode][Org-mode]]
  - [[#evil-mode][Evil mode]]
  - [[#custom-functions][Custom Functions]]
  - [[#better-execution][Better execution]]
- [[#packages][Packages]]
- [[#templates][Templates]]
  - [[#notes-on-bibliographic-references][Notes on bibliographic references]]

* Init
This file describes all the packages that I want preinstalled by doom.
** Completion
#+begin_src elisp :tangle "init.el"
(doom! :input
       ;;chinese
       ;;japanese
       ;;layout            ; auie,ctsrnm is the superior home row

       :completion
       (company +childframe)          ; the ultimate code completion backend
       ;;helm              ; the *other* search engine for love and life
       ;;ido               ; the other *other* search engine...
       (ivy +icons +precient)              ; a search engine for love and life
       (vertico +icons)           ; the search engine of the future
#+end_src
** UI
#+begin_src elisp :tangle "init.el"
       :ui
       ;;deft              ; notational velocity for Emacs
       doom              ; what makes DOOM look the way it does
       doom-dashboard    ; a nifty splash screen for Emacs
       ;;doom-quit         ; DOOM quit-message prompts when you quit Emacs
       (emoji +unicode)  ; 🙂
       hl-todo           ; highlight TODO/FIXME/NOTE/DEPRECATED/HACK/REVIEW
       hydra
       indent-guides     ; highlighted indent columns
       ;;ligatures         ; ligatures and symbols to make your code pretty again
       ;;minimap           ; show a map of the code on the side
       modeline           ; snazzy, Atom-inspired modeline, plus API
       nav-flash         ; blink cursor line after big motions
       ;;neotree           ; a project drawer, like NERDTree for vim
       ophints           ; highlight the region an operation acts on
        (popup
         +all
         +defaults)   ; tame sudden yet inevitable temporary windows
       ;;tabs              ; a tab bar for Emacs
       ;;treemacs          ; a project drawer, like neotree but cooler
       ;;unicode           ; extended unicode support for various languages
       vc-gutter         ; vcs diff in the fringe
       vi-tilde-fringe   ; fringe tildes to mark beyond EOB
       ;;window-select     ; visually switch windows
       workspaces        ; tab emulation, persistence & separate workspaces
       zen               ; distraction-free coding or writing
#+end_src
** Editor
#+begin_src elisp :tangle "init.el"
       :editor
       (evil +everywhere); come to the dark side, we have cookies
       file-templates    ; auto-snippets for empty files
       fold              ; (nigh) universal code folding
       (format +onsave)  ; automated prettiness
       ;;god               ; run Emacs commands without modifier keys
       ;;lispy             ; vim for lisp, for people who don't like vim
       multiple-cursors  ; editing in many places at once
       ;;objed             ; text object editing for the innocent
       ;;parinfer          ; turn lisp into python, sort of
       ;;rotate-text       ; cycle region at point between text candidates
       snippets          ; my elves. They type so I don't have to
       ;;word-wrap         ; soft wrapping with language-aware indent
#+end_src
** Emacs
#+begin_src elisp :tangle "init.el"
       :emacs
       (dired +icons)             ; making dired pretty [functional]
       electric          ; smarter, keyword-based electric-indent
       ;;ibuffer         ; interactive buffer management
       undo              ; persistent, smarter undo for your inevitable mistakes
       vc                ; version-control and Emacs, sitting in a tree
#+end_src
** Term
#+begin_src elisp :tangle "init.el"
       :term
       ;;eshell            ; the elisp shell that works everywhere
       ;;shell             ; simple shell REPL for Emacs
       ;;term              ; basic terminal emulator for Emacs
       vterm             ; the best terminal emulation in Emacs
#+end_src
** Checkers
#+begin_src elisp :tangle "init.el"
       :checkers
       syntax              ; tasing you for every semicolon you forget
       (spell +flyspell) ; tasing you for misspelling mispelling
       grammar           ; tasing grammar mistake every you make
#+end_src
** Tools
#+begin_src elisp :tangle "init.el"
       :tools
       ;;ansible
       (debugger +lsp)          ; FIXME stepping through code, to help you add bugs
       ;;direnv
       ;;docker
       ;;editorconfig      ; let someone else argue about tabs vs spaces
       ;;ein               ; tame Jupyter notebooks with emacs
       (eval +overlay)     ; run code, run (also, repls)
       ;;gist              ; interacting with github gists
       lookup              ; navigate your code and its documentation
       (lsp +peek)               ; M-x vscode
       (magit)             ; a git porcelain for Emacs
       ;;make              ; run make tasks from Emacs
       ;;pass              ; password manager for nerds
       pdf               ; pdf enhancements
       ;;prodigy           ; FIXME managing external services & code builders
       rgb               ; creating color strings
       ;;taskrunner        ; taskrunner for all your projects
       ;;terraform         ; infrastructure as code
       ;;tmux              ; an API for interacting with tmux
       upload            ; map local to remote projects via ssh/ftp
#+end_src
** OS
#+begin_src elisp :tangle "init.el"
       :os
       (:if IS-MAC macos)  ; improve compatibility with macOS
       tty               ; improve the terminal Emacs experience
#+end_src
** Languages
#+begin_src elisp :tangle "init.el"
       :lang
       (cc +lsp)                ; C > C++ == 1
       (emacs-lisp
        +lsp)       ; drown in parentheses
       (go +lsp)         ; the hipster dialect
       json              ; At least it ain't XML
       (javascript +lsp)        ; all(hope(abandon(ye(who(enter(here))))))
       (latex +dvipng)             ; writing papers in Emacs has never been so fun
       lua               ; one-based indices? one-based indices
       markdown          ; writing docs for people to ignore
       (org              ; organize your plain life in plain text
        +attach          ; custom attachment system
        +babel           ; running code in org
        +roam2
        +hugo
        +journal
        +pandoc
        +pretty
        +capture         ; org-capture in and outside of Emacs
        +export          ; Exporting org to whatever you want
        +present)
       (java +lsp +meghanda)
       php               ; perl's insecure younger brother
       (python
        +conda
        +lsp
        +pyright
        +pyenv
        +poetry)
       (rust
        +lsp)              ; Fe2O3.unwrap().unwrap().unwrap().unwrap()
       (sh +lsp +fish)                ; she sells {ba,z,fi}sh shells on the C xor
       web               ; the tubes
       yaml              ; JSON, but readable
#+end_src
*** Disabled
#+begin_src elisp :tangle "init.el"
       ;;zig               ; C, but simpler
       ;;agda              ; types of types of types of types...
       ;;beancount         ; mind the GAAP
       ;;clojure           ; java with a lisp
       ;;common-lisp       ; if you've seen one lisp, you've seen them all
       ;;coq               ; proofs-as-programs
       ;;crystal           ; ruby at the speed of c
       ;;csharp            ; unity, .NET, and mono shenanigans
       ;;data              ; config/data formats
       ;;(dart +flutter)   ; paint ui and not much else
       ;;dhall
       ;;elixir            ; erlang done right
       ;;elm               ; care for a cup of TEA?
       ;;erlang            ; an elegant language for a more civilized age
       ;;ess               ; emacs speaks statistics
       ;;factor
       ;;faust             ; dsp, but you get to keep your soul
       ;;fsharp            ; ML stands for Microsoft's Language
       ;;fstar             ; (dependent) types and (monadic) effects and Z3
       ;;gdscript          ; the language you waited for
       ;;(java +meghanada) ; the poster child for carpal tunnel syndrome
       ;;julia             ; a better, faster MATLAB
       ;;kotlin            ; a better, slicker Java(Script)
       ;;lean              ; for folks with too much to prove
       ;;ledger            ; be audit you can be
       ;;sml
       ;;nim               ; python + lisp at the speed of c
       ;;nix               ; I hereby declare "nix geht mehr!"
       ;;ocaml             ; an objective camel
       ;;plantuml          ; diagrams for confusing people more
       ;;purescript        ; javascript, but functional
       ;;solidity          ; do you need a blockchain? No.
       ;;scala             ; java, but good
       ;;(scheme +guile)   ; a fully conniving family of lisps
       ;;swift             ; who asked for emoji variables?
       ;;terra             ; Earth and Moon in alignment for performance.
       ;;qt                ; the 'cutest' gui framework ever
       ;;racket            ; a DSL for DSLs
       ;;raku              ; the artist formerly known as perl6
       ;;rest              ; Emacs as a REST client
       ;;rst               ; ReST in peace
       ;;(ruby +rails)     ; 1.step {|i| p "Ruby is #{i.even? ? 'love' : 'life'}"}
#+end_src
** Email, Apps and Config
#+begin_src elisp :tangle "init.el"
       :email
       (mu4e +org +gmail)
       ;;notmuch
       ;;(wanderlust +gmail)

       :app
       ;;calendar
       ;;emms
       ;;everywhere        ; *leave* Emacs!? You must be joking
       ;;irc               ; how neckbeards socialize
       ;;(rss +org)        ; emacs as an RSS reader
       ;;twitter           ; twitter client https://twitter.com/vnought

       :config
       ;;literate
       (default +bindings +smartparens))
#+end_src

* Config
This is the meat of the config. Where most of the actual configuration happens.
** Analisis
Some variables to see what is making emacs slow.
#+begin_src elisp :tangle "config.el"
(setq use-package-compute-statistics nil)
(setq nand2tetris-core-base-dir "~/Downloads/")
#+end_src
** Garbage collection
#+begin_src elisp :tangle "config.el"
(server-start)
;; (setq gc-cons-threshold (100000000))
;; (setq gc-cons-percentage 0.5)
;; (run-with-idle-timer 5 t #'garbage-collect)
#+end_src
** Backup
#+begin_src elisp :tangle "config.el"
(setq backup-by-copying t ; don't clobber symlinks
      backup-directory-alist '(("." . "~/.saves")) ; don't litter my fs tree
      delete-old-versions t
      kept-new-versions 6
      kept-old-versions 2
      version-control t)
#+end_src
** Main Variables
Some variable's used all over the config
#+begin_src elisp :tangle "config.el"
(setq user-full-name "Italo Amaya Arlotti"
      user-mail-address "italoamaya@icloud.com")

(defvar Dropbox-dir "~/Personal/Dropbox"
  "Path the the directory of dropbox")


(setq doom-theme 'doom-gruvbox-light
      doom-font (font-spec :family "Monaco" :size 16 :height 181 :weight 'light)
      doom-variable-pitch-font (font-spec :family "Monaco" :size 18)
      doom-big-font (font-spec :family "Monaco" :size 24))

(setq +snippets-dir "~/Personal/Programing/Emacs/Snippets/")

(defconst doom-frame-transparency 100)
(set-frame-parameter (selected-frame) 'alpha doom-frame-transparency)
(add-to-list 'default-frame-alist `(alpha . ,doom-frame-transparency))
(defun dwc-smart-transparent-frame ()
  (set-frame-parameter
    (selected-frame)
    'alpha (if (frame-parameter (selected-frame) 'fullscreen)
              100
             doom-frame-transparency)))

#+end_src

#+RESULTS:
: dwc-smart-transparent-frame

** Emacs Configuration
#+begin_src elisp :tangle "config.el"
(setq display-line-numbers-type 'relative)
(setq confirm-kill-emacs nil)
(setq scroll-margin 8)
(setq tramp-default-method "ssh")
(smooth-scrolling-mode 1)
#+end_src

** Splash Screen config
#+begin_src elisp :tangle "config.el"
(defvar +fl/splashcii-query ""
  "The query to search on asciiur.com")

(defun +fl/splashcii-banner ()
  (mapc (lambda (line)
          (insert (propertize (+doom-dashboard--center +doom-dashboard--width line)
                              'face 'doom-dashboard-banner) " ")
          (insert "\n"))
        (split-string (with-output-to-string
                        (call-process "splashcii" nil standard-output nil +fl/splashcii-query))
                      "\n" t)))

(setq +doom-dashboard-ascii-banner-fn #'+fl/splashcii-banner)

(setq +fl/splashcii-query "dragon")
;; (setq fancy-splash-image (concat doom-private-dir "bonsai.png"))

(remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-shortmenu)
;; (remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-loaded)
(remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-footer)
(add-hook! '+doom-dashboard-mode-hook (hide-mode-line-mode 1) (hl-line-mode -1))
(setq-hook! '+doom-dashboard-mode-hook evil-normal-state-cursor (list nil))
#+end_src

** Key Bindings
*** Find Files
#+begin_src elisp :tangle "config.el"
(map! :leader "f i D" #'italo/find/downloads)
(map! :leader "f i d" #'italo/find/doters)
(map! :leader "f i h" #'italo/find/Hugo)
(map! :leader "f i r" #'italo/find/Roam)
(map! :leader "f i R" #'italo/find/Repos)
#+end_src
*** Referencing
#+begin_src elisp :tangle "config.el"
(map!
      :leader
      (:prefix-map ("L" . "Library")
       :desc "open Library" "L" (lambda () (interactive)(find-file (concat org-roam-directory "references/Library.bib")))
       :desc "Find entry" "f" #'ivy-bibtex
       :desc "Org Ref Hydra citation" "R" #'org-ref-citation-hydra/body
       :desc "Org Ref Hydra bibtex" "r" #'org-ref-bibtex-hydra/body
       :desc "New entry from DOI" "d" #'doi-add-bibtex-entry
       )
      )
#+end_src
*** Ssh Deploy
#+begin_src elisp :tangle "config.el"
(map!
 :leader
 :desc "ssh deploy hydra panel" "r p" #'ssh-deploy-hydra/body
 )
#+end_src

*** Org Noter
#+begin_src elisp :tangle "config.el"
(map!
      :leader
      :map org-noter-notes-mode-map
      :desc "open org noter" "m n" #'org-noter
      ;; use Hydra to move arround
      )
#+end_src
*** Org roam bibtex
#+begin_src elisp :tangle "config.el"
(map!
      :leader
      :desc "insert bibliographic orb note" "n r b" #'orb-insert-link
      )
#+end_src
*** Org roam
#+begin_src elisp :tangle "config.el"
;; (map!
;;       :desc "insert bibliographic orb note" "C-i" #'org-roam-node-insert
;;       )
#+end_src
*** Org Noter
#+begin_src elisp :tangle "config.el"
(map! :leader :desc "noter precise note" "n r N i" #'org-noter-insert-precise-note)
#+end_src
*** Flyspell
#+begin_src elisp :tangle "config.el"
(map! :leader
      :desc "Correct Word"
      "t s" #'flyspell-auto-correct-word)

(map! :leader
      :desc "Change Dictionary"
      "t d" #'fd-switch-dictionary)
#+end_src

*** Rust
#+begin_src elisp :tangle "config.el"
(map! :after rustic-mode
      :map rustic-mode-map
      :leader
      :desc "Cargo add create"
      "m a" #'rustic-cargo-add)
#+end_src
*** Window Management
#+begin_src elisp :tangle "config.el"
(map! :leader
      :desc "delete other windows"
      "w w" #'delete-other-windows)
#+end_src
