Emacs/.doom.d/My_Doom.org
**** Org preview
#+begin_src elisp :tangle "config.el"
(use-package! org-preview
  :after org
  :config
  (setq org-format-latex-options (plist-put org-format-latex-options :scale 2.0)))

(add-hook! 'org-mode-hook #'org-preview-mode)
#+end_src
**** Org Sticky header
#+begin_src elisp :tangle "config.el"
(use-package! org-sticky-header
  :after org
  :hook (org-mode . org-sticky-header-mode))

#+end_src
**** Org Ref
#+begin_src elisp :tangle "config.el"
(use-package! org-ref
  :after org
  :init
  (setq bibtex-autokey-year-length 4
    bibtex-autokey-name-year-separator "-"
    bibtex-autokey-year-title-separator "-"
    bibtex-autokey-titleword-separator "-"
    bibtex-autokey-titlewords 2
    bibtex-autokey-titlewords-stretch 1
    bibtex-autokey-titleword-length 5
    bibtex-completion-pdf-field "file"
    bibtex-completion-pdf-symbol "⌘"
    bibtex-completion-notes-symbol "✎"
    )
  (setq org-latex-pdf-process (list "latexmk -f -pdf -%latex -interaction=nonstopmode -bibtex -output-directory=%o %f"))

  (setq bibtex-completion-display-formats
    '((article       . "${=has-pdf=:1}${=has-note=:1} ${=type=:3} ${year:4} ${author:36} ${title:*} ${journal:40}")
      (inbook        . "${=has-pdf=:1}${=has-note=:1} ${=type=:3} ${year:4} ${author:36} ${title:*} Chapter ${chapter:32}")
      (incollection  . "${=has-pdf=:1}${=has-note=:1} ${=type=:3} ${year:4} ${author:36} ${title:*} ${booktitle:40}")
      (inproceedings . "${=has-pdf=:1}${=has-note=:1} ${=type=:3} ${year:4} ${author:36} ${title:*} ${booktitle:40}")
      (t             . "${=has-pdf=:1}${=has-note=:1} ${=type=:3} ${year:4} ${author:36} ${title:*}")))

  (setq org-ref-insert-link-function 'org-ref-insert-link-hydra/body
      org-ref-insert-cite-function 'org-ref-cite-insert-ivy
      org-ref-csl-default-style (concat org-directory "/templates/harvard-university-of-leeds.csl")
      org-ref-insert-label-function 'org-ref-insert-label-link
      org-ref-insert-ref-function 'org-ref-insert-ref-link
      org-ref-cite-onclick-function (lambda (_) (org-ref-citation-hydra/body)))
  )
#+end_src
**** Bibtex
#+begin_src elisp :tangle "config.el"
(setq bibtex-completion-bibliography (concat org-roam-directory "references/Library.bib")
      bibtex-completion-library-path (concat org-roam-directory "references/sources/")
)
#+end_src
**** Org Noter
#+begin_src elisp :tangle "config.el"
(use-package! org-noter
  :after org
  :config
  (setq org-noter-notes-search-path (concat org-roam-directory "references/sources/")))
#+end_src
**** Org Auto Tangle
#+begin_src elisp :tangle "config.el"
(use-package! org-auto-tangle
  :hook (org-mode . org-auto-tangle-mode))
#+end_src
**** Ox Hugo
#+begin_src elisp :tangle "config.el"
(use-package! ox-hugo
  :init
  (setq org-hugo-base-dir (concat org-directory "/Hugo/"))
  :config
  (defun italo/Publish/Hugo ()
    (interactive)
    (setq default-directory org-roam-directory)
    (shell-command "PubHugo")
    (hugcis/publish-lines (concat org-roam-directory "list.txt"))
    (setq default-directory org-hugo-base-dir)
    (shell-command "hugo -D;hugo server"))
  )
#+end_src
**** Org Roam UI
#+begin_src elisp :tangle "config.el"
(use-package! org-roam-ui
    :after org-roam
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start t))
#+end_src
**** Org Download
#+begin_src elisp :tangle "config.el"
(use-package! org-download
    :after org
    :defer nil
    :custom
    (org-download-method 'directory)
    (org-download-image-dir "files")
    (org-download-heading-lvl nil)
    (org-download-timestamp "%Y%m%d-%H%M%S_")
    (org-download-image-org-width 300)
    (org-download-screenshot-method "/usr/local/bin/pngpaste %s")
    :config
    (require 'org-download)
    (org-download-enable))
#+end_src
**** Org Bullets
#+begin_src elisp :tangle "config.el"
(use-package! org-bullets
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("◉" "○" "■" "◆" "▲" "▶")))
#+end_src
**** Org-ox
#+begin_src elisp :tangle "config.el"
(after! ox-latex
  (add-to-list 'org-latex-classes
               '("org-plain-latex"
               "\\documentclass{article}
           [NO-DEFAULT-PACKAGES]
           [PACKAGES]
           [EXTRA]"
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))
#+end_src
**** Svg Tag mode
#+begin_src elisp :tangle "config.el"
(use-package! svg-tag-mode
  :after org
  :config
  (setq svg-tag-tags
        '(
          ("\\(:[A-Z]+:\\)" . ((lambda (tag)
                                 (svg-tag-make tag :beg 1 :end -1))))
          ("\\(=[A-Z]+=\\)" . ((lambda (tag)
                                 (svg-tag-make tag :beg 1 :end -1))))
        )
  ))

#+end_src
**** Org Fancy Priorities
#+begin_src elisp :tangle "config.el"
(after! org-fancy-priorities
  (setq org-fance-priorities-list '("■","■","■")))
#+end_src
** Evil mode
#+begin_src elisp :tangle "config.el"
(evil-global-set-key 'motion "j" 'evil-next-visual-line)
(evil-global-set-key 'motion "k" 'evil-previous-visual-line)
(define-key evil-ex-map "W" 'save-buffer)
(define-key evil-ex-map "q" 'save-buffer)
#+end_src
** Custom Functions
*** Change Dictionary
#+begin_src elisp :tangle "config.el"
(defun fd-switch-dictionary()
      (interactive)
      (let* ((dic ispell-current-dictionary)
    	 (change (if (string= dic "spanish") "english" "spanish")))
        (ispell-change-dictionary change)
        (message "Dictionary switched from %s to %s" dic change)
        ))
#+end_src
*** Bibtex from Jstore
#+begin_src elisp :tangle "config.el"
(defun insert-bibtex-from-jstor-stable-url (link)
  (interactive "sJstor Link: ")
  (shell-command (format (concat "~/.config/Bin/practical/getJstorLink.sh " "'" "%s" "'") link)))

#+end_src

*** Ox-latex
#+begin_src elisp :tangle "config.el"
(defun insert-setup-file()
  (interactive)
  (insert (concat "#+SETUPFILE: " org-directory "/templates/org-plain-latex-export.org")))
#+end_src
*** Insert file path
#+begin_src elisp :tangle "config.el"
(defun insert-file-path ()
  "Insert file path."
  (interactive)
  (unless (featurep 'counsel) (require 'counsel))
        (ivy-read "Find file: " 'read-file-name-internal
                  :matcher #'counsel--find-file-matcher
                  :action
                  (lambda (x)
                    (insert x))))
#+end_src
*** Open term
#+begin_src elisp :tangle "config.el"
(defun oterm()
  (interactive)
  (vterm)
  (doom/window-maximize-buffer))
#+end_src
*** Find Functions
#+begin_src elisp :tangle "config.el"
(defun italo/find/Repos ()
  (interactive)
  (doom-project-find-file "/Users/italo/Personal/Programing/Repos/"))

(defun italo/find/Roam ()
  (interactive)
  (doom-project-find-file org-roam-directory))

(defun italo/find/Hugo ()
  (interactive)
  (doom-project-find-file (concat org-directory "/Hugo/")))

(defun italo/find/doters ()
  (interactive)
  (doom-project-find-file "~/Dot/"))

(defun italo/find/downloads ()
  (interactive)
  (doom-project-find-file "~/Downloads/"))
#+end_src
*** Exec Functions
#+begin_src elisp :tangle "config.el"
(defun italo/exec/ghqGet (link)
  (interactive "sRepo Link: ")
  (shell-command (format "ghq get %s" link)))

#+end_src

** Better execution
#+begin_src elisp :tangle "config.el"
(use-package! exec-path-from-shell
 :custom
 (shell-file-name "/usr/local/bin/fish" "This is necessary because some Emacs install overwrite this variable")
 (exec-path-from-shell-variables '("PATH" "MANPATH" "PKG_CONFIG_PATH") "This adds PKG_CONFIG_PATH to the list of variables to grab. I prefer to set the list explicitly so I know exactly what is getting pulled in.")
 :init
  (if (string-equal system-type "darwin")
    (exec-path-from-shell-initialize)))
#+end_src
* Packages
#+begin_src elisp :tangle "packages.el"
;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

;; To install a package with Doom you must declare them here and run 'doom sync'
;; on the command line, then restart Emacs for the changes to take effect -- or
;; use 'M-x doom/reload'.
(package! exec-path-from-shell)
(package! org-bullets)
(package! beacon)
(package! org-ref)
(package! ivy-bibtex)
(package! spacemacs-theme)
(package! tree-sitter)
(package! tree-sitter-langs)
(package! tsc)
(package! org-ol-tree
  :recipe (:host github :repo "Townk/org-ol-tree" :branch "main"))
(package! topsy
  :recipe (:host github :repo "alphapapa/topsy.el" :branch "master"))
(package! nano-theme
  :recipe (:host github :repo "rougier/nano-theme" :branch "master"))
(package! org-auto-tangle)
(package! org-sticky-header)
(package! smooth-scrolling)
(package! olivetti)
(package! valign)
(package! poet-theme)
(package! dap-mode)
(package! rainbow-mode)
(package! modus-themes)
(package! solo-jazz-theme)
(package! srcery-theme)
(package! org-download)
(package! org-roam-ui)
(package! org-noter)
(package! org-roam-bibtex)
(package! explain-pause-mode)
(package! tron-legacy-theme)
(package! svg-tag-mode)
(package! org-preview
  :recipe (:host github :repo "karthink/org-preview" :branch "master"))
(package! bespoke-themes
  :recipe (:host github :repo "mclear-tools/bespoke-themes" :branch "main"))
(package! 0x0
  :recipe (:host gitlab :repo "willvaughn/emacs-0x0"))
#+end_src

* Templates
** Notes on bibliographic references
[[file:./templates/bibnote.org]]
