Emacs/.doom.d/packages.el
;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

;; To install a package with Doom you must declare them here and run 'doom sync'
;; on the command line, then restart Emacs for the changes to take effect -- or
;; use 'M-x doom/reload'.

(package! beacon)
(package! org-bullets)
(package! spacemacs-theme)
(package! smooth-scrolling)
(package! olivetti)
(package! poet-theme)
(package! modus-themes)
(package! solo-jazz-theme)
(package! srcery-theme)
(package! org-download)
(package! org-roam-ui)
